package ex8

//import "fmt"

func main() {
	//var s string = "hello"

	// сокращенная запись
	//s := "hey"

	//q := `
	//	SELECT *
	//	FROM person
	//	WHERE age > 18
	//`

	// Строки можно сравнивать операторами: ==, >, <, ⇐, >=. Если с == все понятно, то остальные вызывают вопросы. Строка №1 больше строки №2, если строка №2 меньше размером и является подстрокой строки №1. Это свойство часто используется при сортировке массива строк:
	//"привет" == "привет" // true
	//"golang" > "go"      // true

	//"hello " + "world" // "hello world"

	//username := "Ivan"

	//greetings := fmt.Sprintf("hello, %s", username) // "hello, Ivan"

	//len("go") // 2

	// будьте внимательны! Функция считает кол-во байт, а не кол-во символов
	//len("го") // 4
}
